In [17]:
#ตรวจสอบข้อมูล
#การหั่นข้อมูลและการเข้าข้อมูลแบบ ไฟล์ excel

In [ ]:
# #การตรวจสอบข้อมูล ใน DataFrame
# -head() คือการอ่านข้อมูล 5 แถวแรก ,ถ้าเราไม่กำหนดจำนวนแถวให้มัน มันจะแสดงให้  5 แถว เป็น Defult
# -head(n) คือการอ่านข้อมูล n แถวแรก
# -tail() คือการอ่านข้อมูล 5 แถวสุดท้าย
# -tail(n) คือการอ่านข้อมูล n แถวสุดท้าย
# -sample(n) คือการสุ่มข้อมูล n แถว ,หรือการสุ่มจำนวนขึ้นมา
# -describe() คือการดูค่าสถิติ เช่น ค่าต่ำสุด - สูงสุด ค่าเฉลี่ยข้อมูล เป็นต้น
# -shape คือใช้สำหรับนับตำนวนข้อมูล เช่น (20,4) คือ 20 แถว 4 คอลัมน์
# -columns คือการตรวจสอบว่ามีคอลัมน์อะไรบ้าง
# -value คือการอ่านข้อมูลแบบ Array

#ทำงานกับการอ่านข้อมูลแบบไหนก็ได้ เช่น การอ่านเข้ามาแบบ excel หรือ การอ่านเข้ามา แบบ csv หรือแค่เรามี dataframe เราสามารถใช้คำสั่งพวกนี้ได้หมดเลย

In [ ]:
#เพิ่มเติม ***มันเกี่ยวกับเรื่องชนิดข้อมูล **หรือ basicpandasjupyter19
# #ดูค่าทางสถิติเบื้องต้น
# -mean() คือค่าเฉลี่ย
# -max() คือค่าสูงสุด
# -min() คือค่าต่ำสุด
# -count() คือการนับจํานวนข้อมูลทั้งหมด
# -std() คือส่วนเบี่ยงเบนมาตรฐาน
# -sum() คือผลรวมข้อมูล

In [20]:
import pandas as pd

In [21]:
df = pd.read_excel("dataupdate.xlsx","Product")

In [22]:
df

                 Name            Category    Price
0               เมาส์  อุปกรณ์คอมพิวเตอร์    900.0
1               ปากกา     อุปกรณ์การเรียน      NaN
2               โคมไฟ                 NaN      NaN
3            ไมโครโฟน                 NaN    750.0
4       เครื่องซักผ้า     เครื่องใช้ไฟฟ้า      NaN
5       เสื้อยืดคอกลม            เสื้อผ้า    500.0
6         กางเกงยีนต์            เสื้อผ้า      NaN
7       ตุ๊กตาหมีพูห์             ของเล่น    950.0
8                โซฟา        เฟอร์นิเจอร์   5000.0
9                 จาน         เครื่องครัว    250.0
10               ทีวี     เครื่องใช้ไฟฟ้า  15000.0
11              ยางลบ     อุปกรณ์การเรียน      NaN
12  External HardDisk  อุปกรณ์คอมพิวเตอร์   2500.0
13          คีย์บอร์ด  อุปกรณ์คอมพิวเตอร์    850.0
14           รถบังคับ             ของเล่น      NaN

In [23]:
#แสดงข้อมูล 5 แถวแรก
df.head()
#ถ้าไม่ระบุตัวเลข มันจะให้ จำนวน defult ออกมา หรือ ออกมาแค่ 5 ตัวแรก

            Name            Category  Price
0          เมาส์  อุปกรณ์คอมพิวเตอร์  900.0
1          ปากกา     อุปกรณ์การเรียน    NaN
2          โคมไฟ                 NaN    NaN
3       ไมโครโฟน                 NaN  750.0
4  เครื่องซักผ้า     เครื่องใช้ไฟฟ้า    NaN

In [24]:
#หรืออยากให้แสดง 10 แถวแรก
df.head(10)

            Name            Category   Price
0          เมาส์  อุปกรณ์คอมพิวเตอร์   900.0
1          ปากกา     อุปกรณ์การเรียน     NaN
2          โคมไฟ                 NaN     NaN
3       ไมโครโฟน                 NaN   750.0
4  เครื่องซักผ้า     เครื่องใช้ไฟฟ้า     NaN
5  เสื้อยืดคอกลม            เสื้อผ้า   500.0
6    กางเกงยีนต์            เสื้อผ้า     NaN
7  ตุ๊กตาหมีพูห์             ของเล่น   950.0
8           โซฟา        เฟอร์นิเจอร์  5000.0
9            จาน         เครื่องครัว   250.0

In [25]:
#อยากให้แสดง 5 แถวสุดท้าย
df.tail()

                 Name            Category    Price
10               ทีวี     เครื่องใช้ไฟฟ้า  15000.0
11              ยางลบ     อุปกรณ์การเรียน      NaN
12  External HardDisk  อุปกรณ์คอมพิวเตอร์   2500.0
13          คีย์บอร์ด  อุปกรณ์คอมพิวเตอร์    850.0
14           รถบังคับ             ของเล่น      NaN

In [26]:
#อยากให้แสดง 10 แถวสุดท้าย
df.tail(10)

                 Name            Category    Price
5       เสื้อยืดคอกลม            เสื้อผ้า    500.0
6         กางเกงยีนต์            เสื้อผ้า      NaN
7       ตุ๊กตาหมีพูห์             ของเล่น    950.0
8                โซฟา        เฟอร์นิเจอร์   5000.0
9                 จาน         เครื่องครัว    250.0
10               ทีวี     เครื่องใช้ไฟฟ้า  15000.0
11              ยางลบ     อุปกรณ์การเรียน      NaN
12  External HardDisk  อุปกรณ์คอมพิวเตอร์   2500.0
13          คีย์บอร์ด  อุปกรณ์คอมพิวเตอร์    850.0
14           รถบังคับ             ของเล่น      NaN

In [27]:
#อยากสุ่มแถว
df.sample()

    Name Category  Price
2  โคมไฟ      NaN    NaN

In [28]:
#อยากสุ่ม 5 แถว
df.sample(5)

                 Name            Category   Price
13          คีย์บอร์ด  อุปกรณ์คอมพิวเตอร์   850.0
6         กางเกงยีนต์            เสื้อผ้า     NaN
1               ปากกา     อุปกรณ์การเรียน     NaN
12  External HardDisk  อุปกรณ์คอมพิวเตอร์  2500.0
0               เมาส์  อุปกรณ์คอมพิวเตอร์   900.0

In [29]:
#อยากดูค่าสถิติ
df.describe()

              Price
count      9.000000
mean    2966.666667
std     4748.025906
min      250.000000
25%      750.000000
50%      900.000000
75%     2500.000000
max    15000.000000

In [30]:
#ดูโครงสร้างของ dataframe
df.shape

(15, 3)

In [31]:
#อยากรู้ว่ามีกี่ columns
df.columns

Index(['Name', 'Category', 'Price'], dtype='object')

In [ ]:
#อยากให้อ่านแบบ Array ,หรือดึงเฉพาะข้อมูลมา
df.values

array([['เมาส์', 'อุปกรณ์คอมพิวเตอร์', 900.0],
       ['ปากกา', 'อุปกรณ์การเรียน', nan],
       ['โคมไฟ', nan, nan],
       ['ไมโครโฟน', nan, 750.0],
       ['เครื่องซักผ้า', 'เครื่องใช้ไฟฟ้า', nan],
       ['เสื้อยืดคอกลม', 'เสื้อผ้า', 500.0],
       ['กางเกงยีนต์', 'เสื้อผ้า', nan],
       ['ตุ๊กตาหมีพูห์', 'ของเล่น', 950.0],
       ['โซฟา', 'เฟอร์นิเจอร์', 5000.0],
       ['จาน', 'เครื่องครัว', 250.0],
       ['ทีวี', 'เครื่องใช้ไฟฟ้า', 15000.0],
       ['ยางลบ', 'อุปกรณ์การเรียน', nan],
       ['External HardDisk', 'อุปกรณ์คอมพิวเตอร์', 2500.0],
       ['คีย์บอร์ด', 'อุปกรณ์คอมพิวเตอร์', 850.0],
       ['รถบังคับ', 'ของเล่น', nan]], dtype=object)

In [35]:
## #ดูค่าทางสถิติเบื้องต้น
# -mean() คือค่าเฉลี่ย
# -max() คือค่าสูงสุด
# -min() คือค่าต่ำสุด
# -count() คือการนับจํานวนข้อมูลทั้งหมด
# -std() คือส่วนเบี่ยงเบนมาตรฐาน
# -sum() คือผลรวมข้อมูล